src/cf/Enums/ТипыХраненияФайлов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыХраненияФайлов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВИнформационнойБазе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВТомахНаДиске</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВоВстроенномХранилищеДвоичныхДанных</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВоВнешнемХранилищеДвоичныхДанных</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВТомахТомНеОпределен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/CommonModules/РаботаСФайламиВХранилищеДвоичныхДанныхСлужебный/Ext/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область СлужебныеПроцедурыИФункции

// Вызывается до начала транзакции.
// Для новых файлов все данные файлы должны быть заполнены.
// 
// Параметры:
//  Контекст - см. РаботаСФайламиСлужебный.КонтекстОбновленияФайла
//
Процедура ПередОбновлениемДанныхФайла(Контекст) Экспорт
	РаботаСФайламиВТомахСлужебный.ПередОбновлениемДанныхФайла(Контекст);
КонецПроцедуры

// Вызывается в транзакции модификации.
//
// Параметры:
//  Контекст - см. РаботаСФайламиСлужебный.КонтекстОбновленияФайла
//  ПрисоединенныйФайл - ОпределяемыйТип.ПрисоединенныйФайлОбъект
//
Процедура ПередЗаписьюДанныхФайла(Контекст, ПрисоединенныйФайл) Экспорт
	РаботаСФайламиВТомахСлужебный.ПередЗаписьюДанныхФайла(Контекст, ПрисоединенныйФайл);
КонецПроцедуры

// Вызывается в транзакции модификации после записи присоединенного файла.
// 
// Параметры:
//  Контекст - см. РаботаСФайламиСлужебный.КонтекстОбновленияФайла
//  ПрисоединенныйФайл - ОпределяемыйТип.ПрисоединенныйФайл
//
Процедура ПриОбновленииДанныхФайла(Контекст, ПрисоединенныйФайл) Экспорт
	Если ПрисоединенныйФайл.ТипХраненияФайла = Перечисления.ТипыХраненияФайлов.ВТомахНаДиске Тогда
		РаботаСФайламиВТомахСлужебный.ПриОбновленииДанныхФайла(Контекст, ПрисоединенныйФайл);
	Иначе
		РаботаСФайламиСлужебный.ПриОбновленииДанныхФайла(Контекст, ПрисоединенныйФайл);
	КонецЕсли;
КонецПроцедуры

// Параметры:
//  Контекст - см. РаботаСФайламиСлужебный.КонтекстОбновленияФайла
//  Успешно - Булево - Истина, если транзакция успешно зафиксирована.
//
Процедура ПослеОбновленияДанныхФайла(Контекст, Успешно) Экспорт
	РаботаСФайламиСлужебный.ПослеОбновленияДанныхФайла(Контекст, Успешно);
КонецПроцедуры

// Определяет реквизит хранения двоичных данных, соответствующий заданному типу хранения файлов.
//
// Параметры:
//  ТипХраненияФайлов - ПеречислениеСсылка.ТипыХраненияФайлов
//  ПолучениеФайлаИзАрхива - Булево
//
// Возвращаемое значение:
//  Строка
//
Функция ОпределитьРеквизитХраненияДвоичныхДанныхПоТипуХраненияФайлов(ТипХраненияФайлов, ПолучениеФайлаИзАрхива = Ложь) Экспорт

	Если ТипХраненияФайлов = Перечисления.ТипыХраненияФайлов.ВИнформационнойБазе Тогда
		Результат = "ДвоичныеДанные";
	ИначеЕсли ТипХраненияФайлов = Перечисления.ТипыХраненияФайлов.ВоВнешнемХранилищеДвоичныхДанных Тогда
		Если ПолучениеФайлаИзАрхива Тогда
 			Результат = "ДвоичныеДанныеВАрхиве";			
		Иначе
 			Результат = "ДвоичныеДанныеВОперационномВнешнемХранилище";
		КонецЕсли;
	ИначеЕсли ТипХраненияФайлов = Перечисления.ТипыХраненияФайлов.ВоВстроенномХранилищеДвоичныхДанных Тогда
		Результат = "ДвоичныеДанныеВОперационномВстроенномХранилище";
	Иначе
		Результат = "";
	КонецЕсли;

	Возврат Результат;

КонецФункции

// Проверяет для типа хранения файлов использование томов хранения файлов, размещающих данные на дисках.
//
// Параметры:
//  ТипХраненияФайлов - ПеречислениеСсылка.ТипыХраненияФайлов
//
// Возвращаемое значение:
//  Булево
//
Функция ТипХраненияНеИспользуетДиски(ТипХраненияФайла) Экспорт
	
	Если ТипХраненияФайла = Перечисления.ТипыХраненияФайлов.ВИнформационнойБазе
			Или ТипХраненияФайла = Перечисления.ТипыХраненияФайлов.ВоВнешнемХранилищеДвоичныхДанных
			Или ТипХраненияФайла = Перечисления.ТипыХраненияФайлов.ВоВстроенномХранилищеДвоичныхДанных Тогда
		Результат = Истина;
	Иначе
		Результат= Ложь;
	КонецЕсли;

	Возврат Результат;

КонецФункции

#КонецОбласти
